brex97/nRF52840_mpu9250/ble_app_uart_mpu9250/main.c
/**@brief  Function for initializing the UART module.
 */
/**@snippet [UART Initialization] */
static void uart_init(void)
{
    uint32_t                     err_code;
    app_uart_comm_params_t const comm_params =
    {
        .rx_pin_no    = RX_PIN_NUMBER,
        .tx_pin_no    = TX_PIN_NUMBER,
        .rts_pin_no   = RTS_PIN_NUMBER,
        .cts_pin_no   = CTS_PIN_NUMBER,
        .flow_control = APP_UART_FLOW_CONTROL_DISABLED,
        .use_parity   = false,
        .baud_rate    = NRF_UART_BAUDRATE_115200
    };

    APP_UART_FIFO_INIT(&comm_params,
                       UART_RX_BUF_SIZE,
                       UART_TX_BUF_SIZE,
                       uart_event_handle,
                       APP_IRQ_PRIORITY_LOWEST,
                       err_code);
    APP_ERROR_CHECK(err_code);
}
/**@snippet [UART Initialization] */


/**@brief Function for initializing the Advertising functionality.
 */
static void advertising_init(void)
{
    uint32_t               err_code;
    ble_advertising_init_t init;

    memset(&init, 0, sizeof(init));

    init.advdata.name_type          = BLE_ADVDATA_FULL_NAME;
    init.advdata.include_appearance = false;
    init.advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;

    init.srdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    init.srdata.uuids_complete.p_uuids  = m_adv_uuids;

    init.config.ble_adv_fast_enabled  = true;
    init.config.ble_adv_fast_interval = APP_ADV_INTERVAL;
    init.config.ble_adv_fast_timeout  = APP_ADV_TIMEOUT_IN_SECONDS;

    init.evt_handler = on_adv_evt;

    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    bsp_event_t startup_event;

    uint32_t err_code = bsp_init(BSP_INIT_LED | BSP_INIT_BUTTONS, bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}

static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}

static void idle_state_handle(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}

/**@brief Function for placing the application in low power state while waiting for events.
 */
/*static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}
 */

void mpu_init(void)
{
    ret_code_t ret_code;
    // Initiate MPU driver
    ret_code = app_mpu_init();
    APP_ERROR_CHECK(ret_code); // Check for errors in return value
    
    // Setup and configure the MPU with intial values
    app_mpu_config_t p_mpu_config = MPU_DEFAULT_CONFIG(); // Load default values
    p_mpu_config.smplrt_div = 19;   // Change sampelrate. Sample Rate = Gyroscope Output Rate / (1 + SMPLRT_DIV). 19 gives a sample rate of 50Hz
    p_mpu_config.accel_config.afs_sel = AFS_2G; // Set accelerometer full scale range to 2G
    ret_code = app_mpu_config(&p_mpu_config); // Configure the MPU with above values
    APP_ERROR_CHECK(ret_code); // Check for errors in return value

    // Enable magnetometer
    app_mpu_magn_config_t magnetometer_config;
    magnetometer_config.mode = CONTINUOUS_MEASUREMENT_100Hz_MODE;
    ret_code = app_mpu_magnetometer_init(&magnetometer_config);
    APP_ERROR_CHECK(ret_code); // Check for errors in return value
}

uint32_t nus_printf_custom(char* p_char)
{
	static uint16_t index;
	uint32_t err_code;
	static uint8_t data_array[BLE_NUS_MAX_DATA_LEN];
	while(*p_char != '\0'){
          data_array[index] = *p_char;
          index++;
          p_char++;
          }
		do {
				err_code = ble_nus_string_send(&m_nus, data_array, &index);
				if ( (err_code != NRF_ERROR_INVALID_STATE) && (err_code != NRF_ERROR_BUSY) )
				{
					break;
				}
		} while (err_code == NRF_ERROR_BUSY);
		index = 0;
	return err_code;
}

/**@brief Application main function.
 */
int main(void)
{
    uint32_t err_code;
    bool     erase_bonds;

    accel_values_t acc_values;
    gyro_values_t gyro_values;
    magn_values_t magn_values;
    uint32_t sample_number = 0;

    const uint8_t MAG_DATA_SIZE = 10;
    uint8_t magn_data[MAG_DATA_SIZE];
    memset(magn_data, 0, MAG_DATA_SIZE);

    // Initialize.
    err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);

    uart_init();
    log_init();
    mpu_init();

    buttons_leds_init(&erase_bonds);
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();

    printf("\r\nUART_MPU9250 Start!\r\n");
    NRF_LOG_INFO("UART_MPU9250 Start!");
    err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);

    // Enter main loop.
    for (;;)
    {
        idle_state_handle();

        char array[BLE_NUS_MAX_DATA_LEN];

        // Read accelerometer sensor values
        err_code = app_mpu_read_accel(&acc_values);
        APP_ERROR_CHECK(err_code);
        //gyro
        err_code = app_mpu_read_gyro(&gyro_values);
        APP_ERROR_CHECK(err_code);
        //magnetometer
        err_code = app_mpu_read_magnetometer(&magn_values, NULL);
        APP_ERROR_CHECK(err_code);

    /*  NRF_LOG_INFO("\033[3;1HAccel Sample # %d\r\nACC_X: %06d\r\nACC_Y: %06d\r\nACC_Z: %06d", ++sample_number, acc_values.x, acc_values.y, acc_values.z);
        NRF_LOG_INFO("\n\rGyro Sample # %d\r\nGYRO_X: %06d\r\nGYRO_Y: %06d\r\nGYRO_Z: %06d", sample_number, gyro_values.x, gyro_values.y, gyro_values.z);
        NRF_LOG_INFO("\n\rMagno Sample # %d\r\nMGN_X: %06d\r\nMGN_Y: %06d\r\nMGN_Z: %06d\r\n", sample_number, magn_values.x, magn_values.y, magn_values.z);
    */  

        sprintf(array, "\n---sample # %d---\n", ++sample_number);
        nus_printf_custom(&array[0]);
        sprintf(array, "accel: %d %d", acc_values.x, acc_values.y);
        nus_printf_custom(&array[0]);
        sprintf(array, " %d\ngyro: %d", acc_values.z, gyro_values.x);
        nus_printf_custom(&array[0]);
        sprintf(array, " %d %d\n", gyro_values.y, gyro_values.z);
        nus_printf_custom(&array[0]);
        sprintf(array, "magn: %d %d", magn_values.x, magn_values.y);
        nus_printf_custom(&array[0]);
        sprintf(array, " %d\n", magn_values.z);
        nus_printf_custom(&array[0]);

        nrf_delay_ms(1000);
    }
}


/**
 * @}
 */
